const DoctorList = [
  {
    value: "عمومی",
    label: "پزشک عمومی",
  },
  {
    value: "داخلی",
    label: "متخصص داخلی",
  },
  {
    value: "زنان",
    label: "متخصص زنان",
  },
  {
    value: "اعصاب",
    label: "متخصص اعصاب و روان",
  },
  {
    value: "اطفال",
    label: "متخصص اطفال",
  },
  {
    value: "حلق",
    label: "متخصص گوش و حلق و بینی",
  },
  {
    value: "قلب",
    label: "متخصص قلب و عروق",
  },
  {
    value: "پوست",
    label: "متخصص پوست",
  },
  {
    value: "اورولوژی",
    label: "متخصص اورولوژی",
  },
  {
    value: "چشم",
    label: "متخصص چشم",
  },
  {
    value: "غدد",
    label: "متخصص غدد",
  },
  {
    value: "ارتوپدی",
    label: "متخصص ارتوپدی",
  },
  {
    value: "بیهوشی",
    label: "متخصص بیهوشی",
  },
  {
    value: "رادیولوژی",
    label: "متخصص رادیولوژی",
  },
  {
    value: "جراحی",
    label: "متخصص جراحی",
  },
  {
    value: "زیبایی",
    label: "متخصص زیبایی",
  },
  {
    value: "عفونی",
    label: "متخصص بیماری های عفونی",
  },
  {
    value: "روماتولوژی",
    label: "متخصص روماتولوژی",
  },
  {
    value: "تغذیه",
    label: "متخصص تغذیه",
  },
  {
    value: "مامایی",
    label: "مامایی",
  },
  {
    value: "دندانپزشکی",
    label: "دندانپزشکی",
  },
  {
    value: "روانپزشکی",
    label: "روانپزشکی",
  },
  {
    value: "روانشناسی",
    label: "روانشناسی",
  },
];
{
}

export default DoctorList;
